1. How to import pandas and check the version?

In [2]:
import pandas as pd
print(pd.__version__)

2.2.2

2. How to create a series from a list, numpy array and dict?

In [3]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
s= pd.Series(mylist)
s2=pd.Series(myarr)
s3=pd.Series(mydict)
s.head()
s2.head()
s3.head()

a    0
b    1
c    2
e    3
d    4
dtype: int64

3. How to convert the index of a series into a column of a dataframe?

In [4]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
df = ser.to_frame().reset_index() 
df.head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

4. How to combine many series to form a dataframe?

In [5]:
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))
df= pd.concat([ser1,ser2],axis=1)
df.head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

5. How to assign name to the series’ index?

In [6]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'),name="alphabets")
ser.head()

0    a
1    b
2    c
3    e
4    d
Name: alphabets, dtype: object

6. How to get the items of series A not present in series B?

In [7]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
res = ser1[~ser1.isin(ser2)]
print(res)

0    1
1    2
2    3
dtype: int64

7. How to get the items not common to both series A and series B?

In [8]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser_u = pd.Series(np.union1d(ser1, ser2)) 
ser_i = pd.Series(np.intersect1d(ser1, ser2)) 
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

In [9]:
ser = pd.Series(np.random.normal(10, 5, 25))
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))
np.percentile(ser, q=[0, 25, 50, 75, 100])

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

9. How to get frequency counts of unique items of a series?

In [10]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.value_counts()

g    7
b    6
d    5
e    4
a    4
f    3
c    1
Name: count, dtype: int64

10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?

In [11]:

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
print("Top 2 Freq:", ser.value_counts())
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

Top 2 Freq: 3    4
1    3
2    3
4    2
Name: count, dtype: int64

/tmp/ipykernel_39826/1915976221.py:4: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Other' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'

0         3
1         1
2     Other
3         1
4         3
5         3
6         1
7     Other
8     Other
9     Other
10        3
11    Other
dtype: object

11. How to bin a numeric series to 10 groups of equal size?

In [12]:
ser = pd.Series(np.random.random(20))
pd.qcut(ser, q=[0, .1, .2, .3, .4, .5, .6, .7, .8, .9, 1], 
        labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0    2nd
1    1st
2    4th
3    5th
4    3rd
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

12. How to convert a numpy array to a dataframe of given shape? (L1)

In [13]:
ser = pd.Series(np.random.randint(1, 10, 35))
df = pd.DataFrame(ser.values.reshape(7,5))
print(df)

   0  1  2  3  4
0  9  7  3  4  4
1  2  3  7  5  3
2  1  2  4  2  6
3  1  8  1  3  4
4  9  9  1  5  6
5  9  2  9  3  1
6  2  3  8  9  2

13. How to find the positions of numbers that are multiples of 3 from a series?

In [14]:
ser = pd.Series(np.random.randint(1, 10, 7))
print(ser)
np.argwhere(ser % 3==0)

0    7
1    1
2    8
3    7
4    9
5    3
6    8
dtype: int64

array([[4],
       [5]])

14. How to extract items at given positions from a series

In [15]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

15. How to stack two series vertically and horizontally ?

In [16]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))
df1= pd.concat([ser1, ser2], axis=0)
df2 = pd.concat([ser1, ser2], axis=1)
df1.head()
df2.head()

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

16. How to get the positions of items of series A in another series B?

In [17]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])
res=[pd.Index(ser1).get_loc(i) for i in ser2]
res

[5, 4, 0, 8]

17. How to compute the mean squared error on a truth and predicted series?

In [18]:

truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)
np.mean(np.square(truth-pred))

np.float64(0.5966235335380461)

18. How to convert the first character of each element in a series to uppercase?

In [19]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser.str.capitalize()

0     How
1      To
2    Kick
3    Ass?
dtype: object

19. How to calculate the number of characters in each word in a series?

In [20]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser.str.len()

0    3
1    2
2    4
3    4
dtype: int64

20. How to compute difference of differences between consequtive numbers of a series?

In [21]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])
diff=ser.diff()
diff2=diff.diff()
print(diff.tolist())
print(diff2.tolist())

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

21. How to convert a series of date-strings to a timeseries?

In [22]:
ser = pd.Series(['01 Jan 2010', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
time_series = pd.to_datetime(ser, errors='coerce', dayfirst=True)

# Display the result
print(time_series)

0   2010-01-01
1          NaT
2          NaT
3          NaT
4          NaT
dtype: datetime64[ns]

22. How to get the day of month, week number, day of year and day of week from a series of date strings?

In [23]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
time_series = pd.to_datetime(ser, errors='coerce')
day_of_month = time_series.dt.day
week_number = time_series.dt.isocalendar().week
day_of_year = time_series.dt.dayofyear
day_of_week = time_series.dt.day_name()
print("Day of Month:\n", day_of_month.tolist())
print("Week Number:\n", week_number.tolist())
print("Day of Year:\n", day_of_year.tolist())
print("Day of Week:\n", day_of_week.tolist())

Day of Month:
 [1.0, nan, nan, nan, nan, nan]
Week Number:
 [53, <NA>, <NA>, <NA>, <NA>, <NA>]
Day of Year:
 [1.0, nan, nan, nan, nan, nan]
Day of Week:
 ['Friday', nan, nan, nan, nan, nan]

23. How to convert year-month string to dates corresponding to the 4th day of the month?

In [24]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])
from dateutil.parser import parse
ser.map(lambda x: parse('04 ' + x))

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

24. How to filter words that contain atleast 2 vowels from a series?

In [25]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])
filter = ser[ser.str.contains(r'[aeiou].*[aeiou]', case=False)]
filter

0     Apple
1    Orange
4     Money
dtype: object

25. How to filter valid emails from a series?

In [26]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
filter=emails[emails.str.contains(pattern)]
filter

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

26. How to get the mean of a series grouped by another series?

In [27]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruit.tolist())
weights.groupby(fruit).mean()

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['banana', 'carrot', 'apple', 'apple', 'apple', 'carrot', 'carrot', 'banana', 'apple', 'apple']

apple     6.2
banana    4.5
carrot    5.0
dtype: float64

27. How to compute the euclidean distance between two series?

In [28]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
sum((p - q)**2)**.5

18.16590212458495

28. How to find all the local maxima (or peaks) in a numeric series?

In [29]:
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])
from scipy.signal import find_peaks
peaks= find_peaks(ser)
peaks

(array([1, 5, 7]), {})

29. How to replace missing spaces in a string with the least frequent character?

In [30]:
my_str = 'dbc deb abed gade'
ser = pd.Series(list(my_str))
freq = ser.value_counts()
least = freq.dropna().index[-1]
"".join(ser.replace(' ', least))

'dbcgdebgabedggade'

30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?

In [31]:
ser = pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

2000-01-01    3
2000-01-08    7
2000-01-15    5
2000-01-22    2
2000-01-29    9
2000-02-05    2
2000-02-12    2
2000-02-19    1
2000-02-26    5
2000-03-04    6
Freq: W-SAT, dtype: int64

31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?

In [32]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
ser.resample('D').ffill() 
ser

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

32. How to compute the autocorrelations of a numeric series?

In [33]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))
autocorrelations = [ser.autocorr(i).round(2) for i in range(11)]
print(autocorrelations[1:])
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

[np.float64(0.45), np.float64(0.07), np.float64(0.11), np.float64(0.14), np.float64(0.19), np.float64(-0.15), np.float64(-0.43), np.float64(-0.44), np.float64(0.21), np.float64(0.54)]
Lag having highest correlation:  10

33. How to import only every nth row from a csv file to create a dataframe?

In [34]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=50)
df2 = pd.concat([chunk.iloc[0] for chunk in df], axis=1)
df2 = df2.transpose()
df2

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9
250,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90,24.4
300,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07,24.8
350,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98,22.9
400,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77,5.6
450,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44,13.4
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8

34. How to change column values when importing csv to a dataframe?

In [35]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv')
df['medv'] = df['medv'].apply(lambda x: 'Low' if x < 25 else 'High')
df.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,High

35. How to create a dataframe with rows as strides from a given series?

In [36]:
L = pd.Series(range(15))
stride = 3
data = L.values.reshape(-1, stride)
df = pd.DataFrame(data)
df

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

36. How to import only specified columns from a csv file?

In [37]:

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', usecols=['crim', 'medv'])
print(df.head())

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2

37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent

In [39]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

print(df.shape)
print(df.dtypes)
print(df.dtypes.value_counts())
df_stats = df.describe()
df_arr = df.values
df_list = df.values.tolist()

(93, 27)
Manufacturer           object
Model                  object
Type                   object
Min.Price             float64
Price                 float64
Max.Price             float64
MPG.city              float64
MPG.highway           float64
AirBags                object
DriveTrain             object
Cylinders              object
EngineSize            float64
Horsepower            float64
RPM                   float64
Rev.per.mile          float64
Man.trans.avail        object
Fuel.tank.capacity    float64
Passengers            float64
Length                float64
Wheelbase             float64
Width                 float64
Turn.circle           float64
Rear.seat.room        float64
Luggage.room          float64
Weight                float64
Origin                 object
Make                   object
dtype: object
float64    18
object      9
Name: count, dtype: int64

38. How to extract the row and column number of a particular cell with given criterion?

In [40]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.loc[df.Price == np.max(df.Price), ['Manufacturer', 'Model', 'Type']]
row, col = np.where(df.values == np.max(df.Price))
df.iat[row[0], col[0]]
df.iloc[row[0], col[0]]

np.float64(61.9)

39. How to rename a specific columns in a dataframe?

In [41]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

df = df.rename(columns={'Type':'CarType'})
print(df.columns)

Index(['Manufacturer', 'Model', 'CarType', 'Min.Price', 'Price', 'Max.Price',
       'MPG.city', 'MPG.highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev.per.mile', 'Man.trans.avail',
       'Fuel.tank.capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn.circle', 'Rear.seat.room', 'Luggage.room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

40. How to check if a dataframe has any missing values?

In [45]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.isnull()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,False,False,False,False,False,False,False,False,True,False,...,False,False,False,False,False,False,True,False,False,False
1,True,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False,False,False,True,...,False,False,False,True,False,False,False,False,False,False
4,False,False,False,True,False,True,False,False,True,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,False,False,False,False,False,False,False,False,True,False,...,False,False,False,False,False,False,True,False,True,False
89,False,False,False,False,False,False,False,False,True,False,...,False,False,False,False,False,False,False,False,False,False
90,False,False,False,False,False,False,False,False,True,False,...,False,False,False,False,False,False,False,False,False,False
91,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
92,True,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

41. How to count the number of missing values in each column?

In [47]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.isnull().sum()

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags               38
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

42. How to replace missing values of multiple numeric columns with the mean?

In [51]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df2=df[['Min.Price', 'Max.Price']] = df[['Min.Price', 'Max.Price']].fillna(df[['Min.Price', 'Max.Price']].mean())
print(df2.head())

   Min.Price  Max.Price
0  12.900000  18.800000
1  29.200000  38.700000
2  25.900000  32.300000
3  17.118605  44.600000
4  17.118605  21.459091

43. How to use apply function on existing columns with global variables as additional arguments?

In [54]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
d = {'Min.Price': np.nanmean, 'Max.Price': np.nanmedian}
df[['Min.Price', 'Max.Price']] = df[['Min.Price', 'Max.Price']].apply(lambda x, d: x.fillna(d[x.name](x)), args=(d, ))
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.900000,15.9,18.80,25.0,31.0,NaN,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.200000,33.9,38.70,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.900000,29.1,32.30,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.118605,37.7,44.60,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.118605,30.0,19.15,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

44. How to select a specific column from a dataframe as a dataframe instead of a series?

In [58]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
type(df[['a']])

pandas.core.frame.DataFrame

45. How to change the order of columns of a dataframe?

In [60]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df[list('cbade')]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

46. How to set the number of rows and columns displayed in the output?

In [66]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
pd.set_option('display.max_columns', 6)
pd.set_option('display.max_rows', 6)
df

   Manufacturer    Model     Type  ...  Weight   Origin                Make
0         Acura  Integra    Small  ...  2705.0  non-USA       Acura Integra
1           NaN   Legend  Midsize  ...  3560.0  non-USA        Acura Legend
2          Audi       90  Compact  ...  3375.0  non-USA             Audi 90
..          ...      ...      ...  ...     ...      ...                 ...
90   Volkswagen  Corrado   Sporty  ...  2810.0  non-USA  Volkswagen Corrado
91        Volvo      240  Compact  ...  2985.0  non-USA           Volvo 240
92          NaN      850  Midsize  ...  3245.0  non-USA           Volvo 850

[93 rows x 27 columns]

47. How to format or suppress scientific notations in a pandas dataframe?

In [67]:
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])
df.round(4)

   random
0  0.0391
1  0.1504
2  0.0000
3  0.0000

48. How to format all the values in a dataframe as percentages?

In [73]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
df = df.applymap(lambda x: '{:.0%}'.format(x))

print(df)

  random
0    71%
1    59%
2    79%
3    35%

/tmp/ipykernel_39826/1529901415.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x: '{:.0%}'.format(x))

49. How to filter every nth row in a dataframe?

In [75]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
print(df.iloc[::10, :][['Manufacturer', 'Model', 'Type']])

   Manufacturer         Model     Type
0         Acura       Integra    Small
10     Cadillac       Seville  Midsize
20     Chrysler       LeBaron  Compact
..          ...           ...      ...
70   Oldsmobile  Eighty-Eight    Large
80       Subaru        Loyale    Small
90   Volkswagen       Corrado   Sporty

[10 rows x 3 columns]

50. How to create a primary key index by combining relevant columns?

In [79]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', usecols=[0,1,2,3,5],names=['Make', 'Model', 'Min.Price', 'Max.Price', 'Price'])
df.set_index(['Make', 'Model'], inplace=True)
print(df.index.is_unique)

True

51. How to get the row number of the nth largest value in a column?

In [85]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
nth_largest = df.index[2]
print(nth_largest)

2

52. How to find the position of the nth largest value greater than a given value?

In [87]:
ser = pd.Series(np.random.randint(1, 100, 15))
given_value = 40
fil_ser = ser[ser > given_value]
print(fil_ser)

1     56
2     45
3     81
      ..
10    80
11    56
12    51
Length: 11, dtype: int64

53. How to get the last n rows of a dataframe with row sum > 100?

In [93]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df['Sum'] = df.sum(axis=1)
fildf = df[df['Sum'] > 100]
n = 3
last = fildf.tail(n)

last

     0   1   2   3  Sum
10  33  18  35  19  105
11  14  38  30  24  106
12  25  32  39  10  106

54. How to find and cap outliers from a series or dataframe column?

In [99]:
ser = pd.Series(np.logspace(-2, 2, 30))
Q1 = ser.quantile(0.05)
Q2 = ser.quantile(0.95)
ser[ser < Q1] = Q1
ser[ser > Q2] = Q2

print("Outliers:")
print(ser)

Outliers:
0      0.016049
1      0.016049
2      0.018874
        ...
27    52.983169
28    63.876672
29    63.876672
Length: 30, dtype: float64

55. How to reshape a dataframe to the largest possible square after removing the negative values?

In [109]:
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
df = df.clip(lower=0)
df = df.dropna()

square_size = int(np.ceil(np.sqrt(df.size)))
df = pd.DataFrame(df.values.reshape((square_size, square_size)))

print("Reshaped DataFrame to a square:")
print(df)

Reshaped DataFrame to a square:
     0   1   2  ...   7   8   9
0   37  32   0  ...  36  30  24
1   29  31   6  ...  48  38  34
2   23  35   0  ...  40  45   0
..  ..  ..  ..  ...  ..  ..  ..
7   29   5  43  ...  30  22  11
8   12   7  20  ...  14   0   0
9    3  43  21  ...  44   0  22

[10 rows x 10 columns]

56. How to swap two rows of a dataframe?

In [113]:
df  = pd.DataFrame(np.arange(25).reshape(5, -1))
df1 = df.copy()
df1.loc[[1, 3]] = df1.loc[[3, 1]].values
df1

    0   1   2   3   4
0   0   1   2   3   4
1  15  16  17  18  19
2  10  11  12  13  14
3   5   6   7   8   9
4  20  21  22  23  24

57. How to reverse the rows of a dataframe?

In [114]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df.iloc[::-1, :]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

58. How to create one-hot encodings of a categorical variable (dummy variables)?

In [116]:
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))
df_onehot = pd.concat([pd.get_dummies(df['a']), df[list('bcde')]], axis=1)
print(df_onehot)

       0      5     10  ...   c   d   e
0   True  False  False  ...   2   3   4
1  False   True  False  ...   7   8   9
2  False  False   True  ...  12  13  14
3  False  False  False  ...  17  18  19
4  False  False  False  ...  22  23  24

[5 rows x 9 columns]

59. Which column contains the highest number of row-wise maximum values?

In [119]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
print('Column with highest row maxes: ', df.apply(np.argmax, axis=1).value_counts().index[0])

Column with highest row maxes:  1

60. How to create a new column that contains the row number of nearest column by euclidean distance?

In [122]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))
import pandas as pd
import numpy as np
from scipy.spatial.distance import cdist

# create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [6, 7, 8, 9, 10],
    'C': [11, 12, 13, 14, 15]
})

distances = cdist(df.values, df.values)
nearest_indices = np.argmin(distances, axis=1)
df['nearest_row'] = nearest_indices
print(df)

   A   B   C  nearest_row
0  1   6  11            0
1  2   7  12            1
2  3   8  13            2
3  4   9  14            3
4  5  10  15            4

61. How to know the maximum possible correlation value of each column against other columns?

In [133]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1), columns=list('pqrstuvwxy'), index=list('abcdefgh'))
max = df.corr().max(axis=0)
max.tolist()

[1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]

62. How to create a column containing the minimum by maximum of each row?

In [138]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
minmax = np.min(df, axis=1)/np.max(df, axis=1)
minmax

0    0.084337
1    0.107527
2    0.212121
       ...
5    0.112245
6    0.166667
7    0.214286
Length: 8, dtype: float64

63. How to create a column that contains the penultimate value in each row?

In [142]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
pu = df.iloc[:, -2]
df["penultimate"]=pu
df

     0   1   2  ...   8   9  penultimate
0   96   1  35  ...  75  28           75
1   96  79  47  ...  62  29           62
2   59  25  68  ...  89  77           89
..  ..  ..  ..  ...  ..  ..          ...
5   92  59  56  ...  86  54           86
6   52  30  25  ...  81  84           81
7   50  27  28  ...  40  74           40

[8 rows x 11 columns]

64. How to normalize all columns in a dataframe?

In [149]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

ndf = (df - df.min()) / (df.max() - df.min())
ndf.round(2)

       0     1     2  ...     7     8     9
0   0.00  0.40  0.68  ...  0.76  0.19  0.51
1   0.78  0.96  0.91  ...  0.13  0.75  0.44
2   0.75  0.18  0.78  ...  0.67  0.58  0.97
..   ...   ...   ...  ...   ...   ...   ...
5   0.49  0.29  1.00  ...  0.00  0.57  0.00
6   0.90  1.00  0.00  ...  1.00  0.00  0.05
7   1.00  0.00  0.57  ...  0.53  0.06  0.78

[8 rows x 10 columns]

65. How to compute the correlation of each row with the suceeding row?

In [153]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
corr = [df.iloc[i].corr(df.iloc[i+1]) for i in range(len(df) - 1)]
corr

[np.float64(0.02968294372260786),
 np.float64(0.5010005673201232),
 np.float64(0.10987267241740835),
 np.float64(0.5997243146025504),
 np.float64(0.6330011110509988),
 np.float64(-0.09882243114110253),
 np.float64(-0.5889976395363917)]

66. How to replace both the diagonals of dataframe with 0?

In [156]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
np.fill_diagonal(df.values, 0)
np.fill_diagonal(np.fliplr(df.values), 0)
print(df)

     0   1   2  ...   7   8   9
0    0  11  36  ...   7  94   0
1   25   0  92  ...  15   0  99
2   49  86   0  ...   0  80  80
..  ..  ..  ..  ...  ..  ..  ..
7   39  35   0  ...   0  86  29
8   34   0   2  ...   2   0  16
9    0  20  81  ...  87  28   0

[10 rows x 10 columns]

67. How to get the particular group of a groupby dataframe by key?

In [166]:
df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,'col2': np.random.rand(9),'col3': np.random.randint(0, 15, 9)})
df1 = df.groupby(['col1'])
apple = df1.groups['apple']
print(df.loc[apple])

    col1      col2  col3
0  apple  0.833047     5
3  apple  0.459021    14
6  apple  0.469056    13

68. How to get the n’th largest value of a column when grouped by another column?

In [177]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,\
                   'rating': np.random.rand(9),\
                   'price': np.random.randint(0, 15, 9)})
df2 = df['rating'].groupby(df.fruit)
df2.get_group('banana').sort_values().iloc[-2]

np.float64(0.6641646061373189)

69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?

In [183]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})
mean= df.groupby('fruit', as_index=False)['price'].mean()
print(mean)

    fruit      price
0   apple   7.666667
1  banana  11.666667
2  orange   5.666667

70. How to join two dataframes by 2 columns so they have only the common rows?

In [192]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

df3= pd.merge(df1, df2, left_on=['fruit', 'weight'], right_on=['pazham', 'kilo'], how='inner')
df3

    fruit weight  price_x  pazham  kilo  price_y
0   apple   high        7   apple  high       10
1  orange    low       13  orange   low        8
2   apple   high        6   apple  high       10
3  orange    low        0  orange   low        8
4   apple   high        3   apple  high       10
5  orange    low        3  orange   low        8

71. How to remove rows from a dataframe that are present in another dataframe?

In [194]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})
print(df1[~df1.isin(df2).all(1)])

     fruit  weight  price
0    apple    high      3
1   banana  medium      7
2   orange     low     12
..     ...     ...    ...
6    apple    high     14
7   banana  medium     13
8   orange     low      0

[9 rows x 3 columns]

72. How to get the positions where values of two columns match?

In [196]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'pazham': ['apple', 'orange', 'pine'] * 3})

np.where(df.fruit == df.pazham)

(array([0, 3, 6]),)

73. How to create lags and leads of a column in a dataframe?

In [197]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))
df['a_lag1'] = df['a'].shift(1)
df['b_lead1'] = df['b'].shift(-1)
print(df)

    a   b   c   d  a_lag1  b_lead1
0   6  28  73  27     NaN     19.0
1   8  19  95  39     6.0     81.0
2  43  81   8  51     8.0     45.0
3  60  45  25  49    43.0     34.0
4  93  34  76  48    60.0      NaN

74. How to get the frequency of unique values in the entire dataframe?

In [198]:
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))

pd.value_counts(df.values.ravel())

/tmp/ipykernel_39826/114147165.py:3: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(df.values.ravel())

7    4
8    4
1    4
    ..
2    1
3    1
9    1
Name: count, Length: 8, dtype: int64

75. How to split a text column into two separate columns?

In [212]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

df1 = df.row.str.split(',|\t', expand=True)
new = df1.iloc[0]
df1= df1[1:]
df1.columns = new
print(df1)

0 STD            City    State
1  33   Kolkata    West Bengal
2  44    Chennai    Tamil Nadu
3  40   Hyderabad    Telengana
4  80   Bangalore    Karnataka